In [2]:
import pandas as pd

In [9]:
titanic = pd.read_csv('titanic.csv') #carregar dataset

In [4]:
titanic.head()#primeiras linhas

  Unnamed: 0 pclass  survived     sex          age sibsp parch
0          1    1st  survived  female           29     0     0
1          2    1st  survived    male  0.916700006     1     2
2          3    1st      died  female            2     1     2
3          4    1st      died    male           30     1     2
4          5    1st      died  female           25     1     2

In [5]:
titanic.tail()#ultimas linhas

     Unnamed: 0 pclass survived     sex   age sibsp parch
2615       1305    3rd     died  female  14.5     1     0
2616       1306    3rd     died  female  9999     1     0
2617       1307    3rd     died    male  26.5     0     0
2618       1308    3rd     died    male    27     0     0
2619       1309    3rd     died    male    29     0     0

In [6]:
titanic.tail(10)#ultimas 10 linhas

     Unnamed: 0 pclass  survived     sex   age sibsp parch
2610       1300    3rd      died    male    27     1     0
2611       1301    3rd  survived  female    15     1     0
2612       1302    3rd      died    male  45.5     0     0
2613       1303    3rd      died    male  9999     0     0
2614       1304    3rd      died    male  9999     0     0
2615       1305    3rd      died  female  14.5     1     0
2616       1306    3rd      died  female  9999     1     0
2617       1307    3rd      died    male  26.5     0     0
2618       1308    3rd      died    male    27     0     0
2619       1309    3rd      died    male    29     0     0

In [7]:
titanic.info() #entradas do dataset

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2620 entries, 0 to 2619
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  2619 non-null   object
 1   pclass      2619 non-null   object
 2   survived    2619 non-null   object
 3   sex         2619 non-null   object
 4   age         2619 non-null   object
 5   sibsp       2619 non-null   object
 6   parch       2619 non-null   object
dtypes: object(7)
memory usage: 143.4+ KB

In [16]:
titanic.isna() # retorna as linhas vazias
titanic.isna().sum()#soma as ocorrencias de linhas vazias

Unnamed: 0    1
pclass        1
survived      1
sex           1
age           1
sibsp         1
parch         1
dtype: int64

In [19]:
titanic['age']==0 #retorna a resposta booleana de todo o datafram

0       False
1       False
2       False
3       False
4       False
        ...
2615    False
2616    False
2617    False
2618    False
2619    False
Name: age, Length: 2620, dtype: bool

In [20]:
titanic[titanic['age']==0] #retorna somente os casos em que atende a condição

Empty DataFrame
Columns: [Unnamed: 0, pclass, survived, sex, age, sibsp, parch]
Index: []

In [22]:
#trazer linha 1 da tabela
titanic.iloc[1]

Unnamed: 0              2
pclass                1st
survived         survived
sex                  male
age           0.916700006
sibsp                   1
parch                   2
Name: 1, dtype: object

In [23]:
titanic.iloc[50]

Unnamed: 0          51
pclass             1st
survived      survived
sex             female
age                 58
sibsp                0
parch                1
Name: 50, dtype: object

In [24]:
#localizar um intervalo de linhas
titanic.iloc[10:15]

   Unnamed: 0 pclass  survived     sex age sibsp parch
10         11    1st      died    male  47     1     0
11         12    1st  survived  female  18     1     0
12         13    1st  survived  female  24     0     0
13         14    1st  survived  female  26     0     0
14         15    1st  survived    male  80     0     0

In [25]:
# localizar um intervalo e linhas e colunas
titanic.iloc[0:5,0:3]

  Unnamed: 0 pclass  survived
0          1    1st  survived
1          2    1st  survived
2          3    1st      died
3          4    1st      died
4          5    1st      died

In [26]:
#localizar pelo nome da coluna
titanic.loc[10:14, 'survived']

10        died
11    survived
12    survived
13    survived
14    survived
Name: survived, dtype: object

In [29]:
#obrigatório passar o nome das colunas como uma lista
titanic.loc[10:14,['pclass', 'survived', 'age']]

   pclass  survived age
10    1st      died  47
11    1st  survived  18
12    1st  survived  24
13    1st  survived  26
14    1st  survived  80

In [30]:
#saber o indice da linha
titanic.index

RangeIndex(start=0, stop=2620, step=1)

In [31]:
titanic.describe()#retorna as estatísticas descritivas do dataframe

       Unnamed: 0 pclass survived   sex   age sibsp parch
count        2619   2619     2619  2619  2619  2619  2619
unique       1310      4        2     3   100     8     9
top             1    3rd     died  male  9999     0     0
freq            2   1418     1618  1686   526  1782  2004

In [33]:
titanic['sex'].unique()
titanic['pclass'].unique() #ocorencias unicas da coluna

array(['1st', '2nd', '3rd', nan, 'pclass'], dtype=object)

In [34]:
titanic['sex'].value_counts()#conta a ocorrencia de que cada atributo

male      1686
female     932
sex          1
Name: sex, dtype: int64

In [35]:
titanic.columns # retorna o nome das colunas

Index(['Unnamed: 0', 'pclass', 'survived', 'sex', 'age', 'sibsp', 'parch'], dtype='object')

In [40]:
#nesse caso ele faz a alteração no dataframe
titanic.rename(columns={'sex':'sexo'},inplace=True)
#ou poderia ser criado um dataframe novo com a alteração
titanic2=titanic.rename(columns={'age':'idade'})

In [38]:
titanic.head()

  Unnamed: 0 pclass  survived    sexo          age sibsp parch
0          1    1st  survived  female           29     0     0
1          2    1st  survived    male  0.916700006     1     2
2          3    1st      died  female            2     1     2
3          4    1st      died    male           30     1     2
4          5    1st      died  female           25     1     2

In [41]:
titanic2.head()

  Unnamed: 0 pclass  survived    sexo        idade sibsp parch
0          1    1st  survived  female           29     0     0
1          2    1st  survived    male  0.916700006     1     2
2          3    1st      died  female            2     1     2
3          4    1st      died    male           30     1     2
4          5    1st      died  female           25     1     2